app/controllers/todo_items_controller.rb

  def create
    @todo_item = @todo_list.todo_items.create(todo_item_params)
---
INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "another one"], ["todo_list_id", 2], ["created_at", "2015-04-17 21:10:52.326730"], ["updated_at", "2015-04-17 21:10:52.326730"]]

  def destroy
    if @todo_item.destroy
---
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 5]]