app/controllers/todo_lists_controller.rb

  def index
    @todo_lists = TodoList.all
---
SELECT "todo_lists".* FROM "todo_lists"

  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "I want a new todo app"], ["description", "but its really a reminder app"], ["created_at", "2015-04-16 20:34:51.481624"], ["updated_at", "2015-04-16 20:34:51.481624"]]

  def destroy
    @todo_list.destroy
---
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 1]]

    def set_todo_list
      @todo_list = TodoList.find(params[:id])
---
SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", 3]]